// messages.ts

export const WELCOME_MESSAGE = `<b>👋 Привіт! Ласкаво просимо до вашого фінансового помічника. 📘</b>\n\n<i>Цей інструмент створено для ефективного обліку вашого бюджету.</i> З його допомогою можна легко відслідковувати <b>Надходження 💰</b> та <b>витрати 📉</b>, а також отримувати зведення за поточним балансом.\n\nДля початку роботи виберіть "Транзакція", а потім визначтеся з типом: "Надходження" або "Витрати". 📊`;
export const ERROR_MESSAGE = '⛔️Сталася помилка під час виконання команди. Будь ласка, спробуйте ще раз пізніше.⛔️';
export const SELECT_TRANSACTION_MESSAGE = 'Оберіть транзакцію:🔽';
export const ENTER_INCOME_MESSAGE =
  'Введіть найменування приходу та суму через пробіл. Для введення кількох транзакцій, розділіть їх комою. \nПриклад: "Зарплата 100000, Бонус 5000"';
export const ENTER_EXPENSE_MESSAGE =
  'Введіть найменування витрати та суму через пробіл. Для введення кількох транзакцій, розділіть їх комою. \nПриклад: "Аренда 2000, Продукти 500"';

export const TRANSACTION_DELETED_MESSAGE = 'Транзакцію видалено🗑️';
export const SELECT_CATEGORY_MESSAGE = 'Оберіеь категорію транзакції:';
export const WANT_STATISTICS_MESSAGE = 'Бажаєте отримати статистику транзакцій? Виберіть параметр: ';
export const INVALID_DATA_MESSAGE = 'Будь ласка, введіть правильні дані.';
export const INVALID_TRANSACTION_NAME_MESSAGE =
  'Будь ласка, вкажіть одне або два слова в полі "Найменування транзакції".';
export const SELECT_MONTH_MESSAGE = 'Оберіть місяць:';
export const BALANCE_MESSAGE = 'Ваш баланс оновлено✅';
